NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
/******************************************************************************
 * File Name:   main.c
 *
 * Description: PSoC 4 SPI Slave with CAPSENSE and Status LED
 * - SPI Slave: SCB0 (SLAVE, MODE0, 8-bit, MSB-first, CS ActiveLow)
 * - CAPSENSE: 36 buttons, immutable double-buffered snapshots
 * - Status LED: P1.6 (CYBSP_LED_SLD3)
 * - FW_VERSION: 0x0000040C (0.4.12)
 * - JIT algo engine: 1KB executable RAM slot (ABI v1, psoc_algo_abi.h),
 *   uploaded via ALGO_BEGIN/PAGE/END/INFO SPI commands, CRC16-CCITT-FALSE
 *   verified commit in main loop, falls back to Cy_CapSense_IsWidgetActive
 *   when no valid algo is loaded.
 ******************************************************************************/

#include "cy_pdl.h"
#include "cybsp.h"
#include "cycfg.h"
#include "cycfg_capsense.h"
#include "psoc_algo_abi.h"
#include <stdint.h>
#include <string.h>

#define FW_VERSION_MAJOR                 (0u)
#define FW_VERSION_MINOR                 (4u)
#define FW_VERSION_PATCH                 (26u)
#define FW_VERSION                       (((uint32_t)FW_VERSION_MAJOR << 16u) | \
                                          ((uint32_t)FW_VERSION_MINOR << 8u) | \
                                          FW_VERSION_PATCH)

#define SENSOR_FRAME_MAGIC               (0xA5u)
#define SENSOR_CMD_PING                  (0x01u)
#define SENSOR_CMD_PONG                  (0x02u)
#define SENSOR_CMD_TOUCH                 (0x03u)  /* 实时触控态：7字节帧 [magic,TOUCH,mask0..mask4] */
#define SENSOR_CMD_SNAPSHOT_BEGIN        (0x10u)
#define SENSOR_CMD_SNAPSHOT_INFO         (0x11u)
#define SENSOR_CMD_SNAPSHOT_PAGE         (0x12u)
#define SENSOR_CMD_SNAPSHOT_DATA         (0x13u)
#define SENSOR_CMD_INDICATOR_ON          (0x20u)
// ---- Phase A：CSD 运行时指令通道（7字节帧 [magic,cmd,ch,param_id,val_lo,val_mid,val_hi]，value 24位）----
#define SENSOR_CMD_SET_PARAM             (0x30u)  // 写 widgetContext[ch].<param_id> = value
#define SENSOR_CMD_GET_PARAM             (0x31u)  // 读回；响应 [magic,GET_PARAM,ch,param_id,val24]
#define SENSOR_CMD_SET_MODE              (0x32u)  // ch 位置=mode(0=自动校准/标准完整处理, 1=半自动手动)
#define SENSOR_CMD_APPLY                 (0x33u)  // 应用参数：重扫/重校准使硬件参数生效
#define SENSOR_CMD_GET_RAW               (0x34u)  // 读指定通道实时 raw 计数；响应 [magic,GET_RAW,ch,raw_lo,raw_hi]
#define SENSOR_CMD_GET_STATS              (0x35u)  // 读全局扫描计数(每秒采样率由 RP2040 用其时钟算)
#define SENSOR_CMD_MEASURE_CP            (0x36u)  // 触发逐电极 Cp 测量；SPI ACK 后由主循环异步执行
#define SENSOR_CMD_GET_CP                (0x37u)  // pending/active=0，成功=fF，失败/未测量=0xFFFFFF
// ---- 全局 CSD 配置(RAM 影子 common config，改后需 APPLY 重初始化生效)----
// 帧 [magic,cmd,gparam_id,0,val_lo,val_mid,val_hi]，值 24 位。
#define SENSOR_CMD_SET_GLOBAL            (0x38u)  // 写 g_common_cfg_ram.<gparam>(仅改影子,不重初始化)
#define SENSOR_CMD_GET_GLOBAL            (0x39u)  // 读回；响应 [magic,GET_GLOBAL,gparam_id,0,val24]
#define SENSOR_CMD_GLOBAL_COMMIT         (0x3Au)  // 全部全局项设完后触发【一次】完整重初始化(合并,防反复重校准漂移)
#define SENSOR_CMD_CALIBRATE             (0x3Bu)  // 真正的 IDAC 重校准(CalibrateAllWidgets)+基线复位, 主循环执行
#define SENSOR_CMD_BASELINE_RESET        (0x3Cu)  // 仅重置全部通道基线(InitializeAllBaselines), 主循环执行
// 频率自适应(三步): ①粗表升分频定位首个可校准档 ②从该档 -1 起逐 1 升频重校准找"临界分频"
// (最后一个仍能校准成功的最小分频=最高频率=最不灵敏) ③按偏好档位往低频让 2*(pref-1) 个分频落档
// (分频越大=频率越低=充电越充分→过充产生近场探测效应→越灵敏), 失败则朝临界方向逐 1 回退。
// 帧字节2=通道号: 0..35=仅该通道自适应(只改该 widget 的 snsClk), 0xFF=全 36 通道【逐通道各自校准】
// (外层遍历 36 个通道, 每通道独立跑完整三步算法得到各自的分频; 面板 Cp 22~138pF 无法共用统一分频)。
// 帧字节3=偏好档位 pref(1..7, 非法值退化为 4): 1=临界最高频(最不灵敏), 7=最低频(最灵敏)。
#define SENSOR_CMD_AUTO_TUNE             (0x3Du)
// 读自适应结果/进度; 响应 [magic,GET_AUTO_TUNE,result(0进行中/1成功/2失败),ch,div_lo,div_hi,progress]。
// ★resp[6]=progress 字节(原 val24 最高字节恒 0, 现复用为阶段进度, 旧 RP2040 只读 resp[4..5] 故向后兼容)★:
//   bit0-2 = phase: 0=空闲/已受理 1=粗定位 2=细搜临界 3=落档/回退 4=完成
//   bit3-7 = step : 当前阶段内步序(从 1 起递增, 上限饱和 31)
// ★resp[4..5]=div 的语义随 result 变化★:
//   result==0(进行中) → 当前正在试探的 snsClk 分频(供上位机显示"正在试 ÷N");
//   result!=0(已完成) → 最终写入 widgetContext 的分频(成功)或 0(失败)。
#define SENSOR_CMD_GET_AUTO_TUNE         (0x3Eu)
#define AUTO_TUNE_CH_ALL                 (0xFFu)  // AUTO_TUNE 通道号哨兵: 全通道
// 全局参数 id
#define GPARAM_INACTIVE_SNS              (0x01u)  // 未激活传感器连接: 1=GND 2=High-Z 4=Shield
#define GPARAM_IDAC_GAIN_INIT            (0x02u)  // csdIdacGainInitIndex(IDAC 增益档索引)
#define GPARAM_IDAC_MIN                  (0x03u)  // csdIdacMin(CSD 校准最小 IDAC)
#define GPARAM_RAW_TARGET                (0x04u)  // csdRawTarget(校准目标 raw 百分比)
#define GPARAM_MFS_DIV_F1                (0x05u)  // csdMfsDividerOffsetF1(多频通道1分频偏移)
#define GPARAM_MFS_DIV_F2                (0x06u)  // csdMfsDividerOffsetF2(多频通道2分频偏移)
#define GPARAM_IDAC_SENSE_CONFIG         (0x07u)  // csdChargeTransfer: 0=IDAC sourcing, 1=IDAC sinking (运行时可设)
#define GPARAM_AUTO_CALIBRATE_EN         (0x08u)  // 运行时是否自动校准: 0=固定IDAC(不自动校准), 1=Init/Apply 自动校准
// 只读: 启动时固件对生成配置做过哪些强制改写(位掩码)。上位机据此把"设备被固件改过"如实告知用户,
// 杜绝"UI 显示用户设定值、设备实际另一个值"的静默不同步。
//   bit0 = IDAC 增益档被抬到下限(生成配置默认 0 会全片 railed, 必须抬)
//   bit1 = 校准目标% 非法(0 或 >=100)被改成 85
#define GPARAM_BOOT_OVERRIDE             (0x09u)
// 注: IDAC 自动校准/补偿IDAC/自动增益 在 CapSense v5 是编译期宏(非 common_config 运行时字段),
//     无法运行时切换; 若需固定IDAC(不自动校准)换稳定灵敏度, 运行时路径=手动设 IDAC_MOD 且不触发校准。
// CapSense 参数 id（与上位机 proto PARAM_* 对齐）
#define PARAM_FINGER_TH                  (0x01u)
#define PARAM_NOISE_TH                   (0x02u)
#define PARAM_NEG_NOISE_TH               (0x03u)
#define PARAM_HYSTERESIS                 (0x04u)
#define PARAM_ON_DEBOUNCE                (0x05u)
#define PARAM_LOW_BSLN_RST               (0x06u)
#define PARAM_RESOLUTION                 (0x07u)
#define PARAM_SNS_CLK_DIV                (0x08u)
#define PARAM_IDAC_MOD                   (0x09u)
#define PARAM_SNS_CLK_SOURCE             (0x0Au)  // 时钟源(bit7=auto, 低位=PRS/direct 选择)
#define PARAM_IDAC_GAIN                  (0x0Bu)  // IDAC 增益档索引(增幅), 半自动手动调优用
// CSD 处理模式
#define SCAN_MODE_AUTO                   (0u)  // 自动校准：运行中间件标准完整处理链
#define SCAN_MODE_SEMI                   (1u)  // 半自动手动：跳过噪声/阈值处理，保留 SET_PARAM 手动值
#define SENSOR_FRAME_SIZE                (7u)
#define SENSOR_FRAME_PAYLOAD_SIZE        (4u)
#define SENSOR_CHANNEL_COUNT             (36u)
#define SENSOR_BYTES_PER_CHANNEL         (7u)
#define SENSOR_SNAPSHOT_SIZE             (SENSOR_CHANNEL_COUNT * SENSOR_BYTES_PER_CHANNEL)
#define SENSOR_SNAPSHOT_PAGE_SIZE        (SENSOR_FRAME_PAYLOAD_SIZE)
#define SENSOR_SNAPSHOT_PAGE_COUNT       (SENSOR_SNAPSHOT_SIZE / SENSOR_SNAPSHOT_PAGE_SIZE)

#define CAPSENSE_INTR_PRIORITY           (3u)
#define CY_ASSERT_FAILED                 (0u)
#define STATUS_LED_PORT                  (CYBSP_LED_SLD3_PORT)
#define STATUS_LED_NUM                   (CYBSP_LED_SLD3_NUM)
#define STATUS_LED_ON_STATE              (1u)
#define STATUS_LED_OFF_STATE             (0u)

#if ((SENSOR_SNAPSHOT_SIZE % SENSOR_SNAPSHOT_PAGE_SIZE) != 0u)
#error "Snapshot size must be an exact number of SPI pages"
#endif

static cy_stc_scb_spi_context_t spi_context;
static uint8_t spi_tx_frame[SENSOR_FRAME_SIZE];
/* 实时触控帧：主循环每个 capsense 周期更新，SPI ISR 作为默认响应装入 TX FIFO（流水线）。 */
static volatile uint8_t touch_frame[SENSOR_FRAME_SIZE];
/* APPLY 指令置位，主循环执行重校准（不能在 ISR 里做耗时重扫描）。 */
static volatile bool apply_pending = false;
/* 硬件参数改变后仅记录对应通道，避免 APPLY 为未修改通道重校准造成状态漂移。 */
static volatile uint64_t idac_dirty_mask = 0u;
/* MEASURE_CP 指令置位，主循环执行逐电极 BIST 电容测量(不能在 ISR 里做耗时测量)。 */
static volatile bool measure_cp_pending = false;
/* SET_GLOBAL 置位：全局 CSD 配置(inactive_sns/IDAC/MFS)改动需完整 Init+Enable 重初始化才能
 * 重算内部预计算(csdInactiveSnsDm/HSIOM 见 cy_capsense_sensing.c)。轻量 APPLY 不够，会坏扫描。
 * 主循环执行与启动同序的 Cy_CapSense_Init+Enable(已验证可用)。 */
static volatile bool global_apply_pending = false;
/* 主循环测量期间保持 true；SPI ISR 据 pending/active 返回 0，避免读到半更新数组。 */
static volatile bool measure_cp_active = false;
/* CALIBRATE 指令置位：主循环执行真正的 IDAC 重校准 CalibrateAllWidgets(不能在 ISR 里做)。 */
static volatile bool calibrate_pending = false;
/* BASELINE_RESET 指令置位：主循环执行 InitializeAllBaselines 重置全部通道基线。 */
static volatile bool baseline_reset_pending = false;
/* AUTO_TUNE 指令置位：主循环执行频率自适应下探(逐档升 snsClk 分频重校准)。 */
static volatile bool auto_tune_pending = false;
/* 自适应结果: 0=未执行/进行中, 1=成功(auto_tune_div 为找到的分频), 2=失败(超硬件上限仍压不到目标)。 */
static volatile uint8_t auto_tune_result = 0u;
/* 自适应成功时找到的 snsClk 分频(已写回目标 widgetContext)。
 * ★全通道(0xFF)模式的完成态语义★: 各通道分频互不相同, 单一分频无意义, 故完成时本字段 = 成功通道数
 * (0..36); 真正的逐通道分频由 RP2040 完成后经 GET_PARAM(0x08) 逐通道回读写穿真相源。 */
static volatile uint16_t auto_tune_div = 0u;
/* 本次自适应的目标通道: 0..35=单通道, AUTO_TUNE_CH_ALL=全通道。GET_AUTO_TUNE 回显该字节。 */
static volatile uint8_t auto_tune_ch = AUTO_TUNE_CH_ALL;
/* 本次自适应的灵敏度偏好档位(1..7, 默认 4=居中): 落档时在临界分频上加 2*(pref-1)(往低频=更灵敏)。 */
static volatile uint8_t auto_tune_pref = 4u;
/* ★阶段性进度★: 长自适应(最坏 ~20s)期间由主循环逐步更新, 经 GET_AUTO_TUNE 的 progress 字节上报,
 * 使 RP2040/上位机在过程中就能看到"到哪一步了", 而非只能干等最终结果。
 * phase: 0=空闲/已受理 1=粗定位 2=细搜临界 3=落档/回退 4=完成; step: 该阶段内步序(1 起, 上报饱和 31)。
 * SPI 是独立中断且优先级(2)高于 CapSense(3), 故校准阻塞期间 ISR 仍能应答这两个量。 */
static volatile uint8_t auto_tune_phase = 0u;
static volatile uint8_t auto_tune_step = 0u;
#define AUTO_TUNE_PHASE_IDLE             (0u)
#define AUTO_TUNE_PHASE_COARSE           (1u)
#define AUTO_TUNE_PHASE_FINE             (2u)
#define AUTO_TUNE_PHASE_SETTLE           (3u)
#define AUTO_TUNE_PHASE_DONE             (4u)
#define AUTO_TUNE_STEP_MAX_REPORT        (31u)
/* 细搜(1 步进上探临界)最大步数: 粗表最大相邻间隔为 48→64 的 16, 取 15 步即可覆盖整个区间;
 * 同时限制全通道模式下额外校准次数(单次全通道校准 ~200-270ms), 保证总耗时留在 RP2040 的 10s 窗内。 */
#define AUTO_TUNE_FINE_STEPS_MAX         (15u)
/* ★处理中锁定/真实完成反馈★：ISR 收到 APPLY/CALIBRATE/BASELINE_RESET/GLOBAL_COMMIT 即置 1,
 * 主循环把对应重操作真正做完后清 0。经 GET_STATS 响应 byte[2] 上报, 供 RP2040 轮询至真实完成
 * (替代原固定 sleep 盲等), 上位机据此显示"处理中"并在真正完成后解锁/刷新, 而非命令一到就误判完成。 */
static volatile uint8_t g_op_busy = 0u;
/* 任一通道的 JIT 算法【显式请求点灯】(io->out_led != 0)。白 LED 的唯一运行时来源。
 * 固件不再从触控判定(out_active)推导灯态 —— 没有算法、或算法不写 out_led 时白灯恒灭。 */
static volatile bool g_any_active = false;
/* 全局"是否自动校准"运行时开关(GPARAM_AUTO_CALIBRATE_EN, 默认开)。开=Init/Apply 走 Enable 自动校准 IDAC;
 * 关=只 Initialize+基线复位, 用固定 IDAC(配置/手动值)换取稳定灵敏度范围(修某些通道自动校准发散 railed)。
 * "校准"命令(SENSOR_CMD_CALIBRATE)始终执行一次显式校准, 不受本开关影响(满足"点校准=单次校准"需求)。 */
static volatile bool g_auto_calibrate = true;
/* 每通道最近一次寄生电容测量值(fF)，0xFFFFFF=失败/未测量。 */
static volatile uint32_t cp_value[SENSOR_CHANNEL_COUNT];
/* CSD 处理模式：SCAN_MODE_AUTO(自动校准/标准完整处理) / SCAN_MODE_SEMI(半自动手动)。 */
static volatile uint8_t scan_mode = SCAN_MODE_AUTO;
static volatile uint32_t scan_count = 0u;  // 每完成一次全通道扫描 +1，自由递增(无触摸也增长)
static uint8_t snapshot_buffers[2u][SENSOR_SNAPSHOT_SIZE];
static uint16_t snapshot_generations[2u];
static volatile uint8_t published_snapshot_index;
static volatile bool published_snapshot_valid;
static uint8_t transfer_snapshot[SENSOR_SNAPSHOT_SIZE];
static uint16_t transfer_generation;
static bool transfer_valid;

