NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
static void initialize_capsense(void)
{
    cy_stc_sysint_t capsense_interrupt_config =
    {
        .intrSrc = CYBSP_CSD_IRQ,
        .intrPriority = CAPSENSE_INTR_PRIORITY,
    };

    if (CY_CAPSENSE_STATUS_SUCCESS == Cy_CapSense_Init(&cy_capsense_context))
    {
        Cy_SysInt_Init(&capsense_interrupt_config, capsense_isr);
        NVIC_ClearPendingIRQ(capsense_interrupt_config.intrSrc);
        NVIC_EnableIRQ(capsense_interrupt_config.intrSrc);
        normalize_widget_params();   /* 首次校准(Enable)前把全部通道分辨率/时钟归一, 消除口径不一致 */
        Cy_CapSense_Enable(&cy_capsense_context);
    }
}

static void snapshot_write_u16(uint8_t * destination, uint16_t value)
{
    destination[0] = (uint8_t)(value & 0xFFu);
    destination[1] = (uint8_t)((value >> 8u) & 0xFFu);
}

static void publish_capsense_snapshot(void)
{
    uint8_t current_index = published_snapshot_index;
    uint8_t next_index = (uint8_t)(current_index ^ 1u);
    uint8_t * destination = snapshot_buffers[next_index];
    uint32_t channel;

    for (channel = 0u; channel < SENSOR_CHANNEL_COUNT; channel++)
    {
        const cy_stc_capsense_sensor_context_t * sensor =
            &cy_capsense_context.ptrWdConfig[channel].ptrSnsContext[0u];
        uint32_t offset = channel * SENSOR_BYTES_PER_CHANNEL;

        snapshot_write_u16(&destination[offset], sensor->raw);
        snapshot_write_u16(&destination[offset + 2u], sensor->bsln);
        snapshot_write_u16(&destination[offset + 4u], sensor->diff);
        destination[offset + 6u] = sensor->status;
    }

    snapshot_generations[next_index] = (uint16_t)(snapshot_generations[current_index] + 1u);
    if (snapshot_generations[next_index] == 0u)
    {
        snapshot_generations[next_index] = 1u;
    }

    {
        uint32_t interrupt_state = Cy_SysLib_EnterCriticalSection();
        published_snapshot_index = next_index;
        published_snapshot_valid = true;
        Cy_SysLib_ExitCriticalSection(interrupt_state);
    }
}

/* 用可加载算法 blob 逐通道计算激活位。返回 0/1。仅在 algo_valid 时被调用；
 * 坏 blob 死循环由 RP2040 侧 PONG 心跳兜底硬复位处理(见设计文档 §1)，PSoC 端不需看门狗。 */
static uint32_t algo_engine_run_channel(uint32_t ch, uint32_t base_active)
{
    const cy_stc_capsense_sensor_context_t * sensor =
        &cy_capsense_context.ptrWdConfig[ch].ptrSnsContext[0u];
    const cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[ch];
    algo_io_t * io = &g_algo_io[ch];
    algo_fn_t algo_fn = (algo_fn_t)(void *)((uintptr_t)algo_slot | 1u);

    /* 非激活→激活边沿：清零持久 state，供算法重新累积包络/滤波历史。 */
    if ((base_active != 0u) && (algo_prev_active[ch] == 0u))
    {
        memset(io->state, 0, sizeof(io->state));
    }
    algo_prev_active[ch] = (uint8_t)base_active;

    io->baseline     = sensor->bsln;
    io->diff         = sensor->diff;
    io->raw          = sensor->raw;
    io->noise_th     = wc->noiseTh;
    io->nnoise_th    = wc->nNoiseTh;
    io->max_raw      = (wc->maxRawCount != 0u) ? wc->maxRawCount : 1024u;
    io->finger_th    = wc->fingerTh;
    io->base_active  = (uint16_t)base_active;
    io->now_ms       = g_ms_tick;
    io->ch           = ch;
    io->rom          = g_algo_rom[ch];   /* 每通道只读 ROM(上位机下发) */
    /* cfg[8] 全通道共享的可设置变量(上位机 ALGO_SET_CFG 下发)。 */
    for (uint32_t k = 0u; k < 8u; k++) { io->cfg[k] = g_algo_cfg[k]; }

    /* 每轮先清点灯请求, 由算法重新声明: 否则换成不写 out_led 的算法后, 上一个算法(如 LED 演示)
     * 留下的 1 会让白灯永久亮着 —— 那又变成了"用户改不掉的灯"。 */
    io->out_led = 0u;

    algo_fn(io);
    return io->out_active;
}

/* 从 capsense 上下文计算 36 区 on/off 位图，更新触控帧（临界区保护，防 SPI ISR 读到半更新）。 */
static void update_touch_frame(void)
{
    uint8_t mask[5] = {0u, 0u, 0u, 0u, 0u};
    uint32_t ch;
    uint32_t st;
    bool use_algo = algo_valid;
    /* 点灯请求只来自算法显式写入的 out_led; 与触控判定(out_active)彻底解耦。 */
    bool algo_led = false;

    for (ch = 0u; ch < SENSOR_CHANNEL_COUNT; ch++)
    {
        uint32_t base_active = Cy_CapSense_IsWidgetActive((uint32_t)ch, &cy_capsense_context);
        uint32_t active;

        if (use_algo)
        {
            active = algo_engine_run_channel(ch, base_active);
            /* 只认算法自己写的 out_led; 算法不写 → 恒 0 → 不点灯。 */
            if (g_algo_io[ch].out_led != 0u) { algo_led = true; }
        }
        else
        {
            active = base_active;
            /* 未加载 JIT 时 trace 仍需反映实测触控态，不能留下上次算法的陈旧结果。 */
            g_algo_io[ch].out_active = (uint16_t)base_active;
            /* 无算法即无点灯请求: 原生 CapSense 触控不得点灯(否则又变成固件写死的触控反馈)。 */
            g_algo_io[ch].out_led = 0u;
        }

        if (active != 0u)
        {
            mask[ch >> 3u] |= (uint8_t)(1u << (ch & 7u));
        }
    }

    /* ★白 LED 只由算法显式请求(out_led)驱动★: 此前这里写的是 `use_algo && algo_active`,
     * 即把触控判定结果当成点灯信号写死 —— 任何算法(含默认 v3.1 HDR)只要判定触摸就必然亮灯,
     * 用户换算法也改不掉。现在改为汇总算法写出的 out_led: 不写该字段的算法一律不点灯。
     * 触控帧输出不受影响, 协议语义不变。 */
    g_any_active = use_algo && algo_led;

    st = Cy_SysLib_EnterCriticalSection();
    touch_frame[0] = SENSOR_FRAME_MAGIC;
    touch_frame[1] = SENSOR_CMD_TOUCH;
    touch_frame[2] = mask[0];
    touch_frame[3] = mask[1];
    touch_frame[4] = mask[2];
    touch_frame[5] = mask[3];
    touch_frame[6] = mask[4];
    Cy_SysLib_ExitCriticalSection(st);
}

/* 把当前触控帧装入 TX FIFO（作为默认/流水线响应）。 */
static void spi_load_touch(void)
{
    uint8_t frame[SENSOR_FRAME_SIZE];
    uint32_t st = Cy_SysLib_EnterCriticalSection();
    frame[0] = touch_frame[0]; frame[1] = touch_frame[1]; frame[2] = touch_frame[2];
    frame[3] = touch_frame[3]; frame[4] = touch_frame[4]; frame[5] = touch_frame[5];
    frame[6] = touch_frame[6];
    Cy_SysLib_ExitCriticalSection(st);
    Cy_SCB_SPI_WriteArray(scb_0_HW, frame, SENSOR_FRAME_SIZE);
}

// ---- Phase A：运行时 CSD 参数读写（直写 cy_capsense_tuner.widgetContext RAM）----
// 阈值类(fingerTh/noiseTh/hysteresis/onDebounce/lowBslnRst)在下次 ProcessAllWidgets 自动生效；
// 硬件类(resolution/snsClk/idacMod)需 APPLY(重扫/重校准)。单字段 16/8 位写在 CM0+ 上原子。
/* CSD 参数合法性防护: 非法值会让转换railed(满量程)/时钟异常/校准发散, 故在应用点拒绝越界值,
 * 保留原值不变。范围依据 CSDv2(cy_capsense_structure.h):
 *   RESOLUTION 6..16 位; SNS_CLK_DIV 1..255(0会除零); IDAC_MOD 0..127(7位);
 *   IDAC_GAIN 增益档 0..7; SNS_CLK_SOURCE 低7位(去 AUTO 0x80)取值 0..6。 */
static bool _param_value_legal(uint8_t param_id, uint32_t value)
{
    switch (param_id)
    {
        case PARAM_RESOLUTION:     return (value >= 6u)  && (value <= 16u);
        case PARAM_SNS_CLK_DIV:    return (value >= 1u)  && (value <= 255u);
        case PARAM_IDAC_MOD:       return (value <= 127u);
        case PARAM_IDAC_GAIN:      return (value <= 6u);   /* 增益档 0..6(表7项,索引7越界崩溃) */
        case PARAM_SNS_CLK_SOURCE: return ((value & 0x7Fu) <= 6u);
        /* 阈值/迟滞/消抖类为 16/8 位任意值, 无硬件危险, 不额外限制。 */
        default: return true;
    }
}

/* 返回是否被接受(合法); 非法直接拒绝, 供 SPI 层回显真实(未改)值让上位机据实回读。 */
static bool cmd_set_param(uint8_t ch, uint8_t param_id, uint32_t value)
{
    if (ch >= SENSOR_CHANNEL_COUNT) return false;
    if (!_param_value_legal(param_id, value)) return false;   // 防护: 拒绝非法值
    cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[ch];
    switch (param_id)
    {
        case PARAM_FINGER_TH:    wc->fingerTh   = (uint16_t)value; break;
        case PARAM_NOISE_TH:     wc->noiseTh    = (uint16_t)value; break;
        case PARAM_NEG_NOISE_TH: wc->nNoiseTh   = (uint16_t)value; break;
        case PARAM_HYSTERESIS:   wc->hysteresis = (uint16_t)value; break;
        case PARAM_ON_DEBOUNCE:  wc->onDebounce = (uint8_t)value;  break;
        case PARAM_LOW_BSLN_RST: wc->lowBslnRst = (uint16_t)value; break;
        case PARAM_RESOLUTION:    wc->resolution   = (uint16_t)value; break;
        case PARAM_SNS_CLK_DIV:   wc->snsClk       = (uint16_t)value; break;
        case PARAM_IDAC_MOD:      wc->idacMod[0]   = (uint8_t)value;  break;
        case PARAM_SNS_CLK_SOURCE:wc->snsClkSource = (uint8_t)value;  break;
        /* 用户显式设增幅 → 锁定该通道, 后续任何校准/Enable 冲回后都会被恢复成此值。 */
        case PARAM_IDAC_GAIN:     wc->idacGainIndex= (uint8_t)value;
                                  g_idac_lock.gain[ch] = (uint8_t)value;
                                  g_idac_lock.mask |= ((uint64_t)1u << ch);
                                  break;
        default: return false;
    }
    if ((param_id == PARAM_SNS_CLK_DIV) || (param_id == PARAM_RESOLUTION) ||
        (param_id == PARAM_IDAC_GAIN))
    {
        idac_dirty_mask |= ((uint64_t)1u << ch);
    }
    return true;
}

static uint32_t cmd_get_param(uint8_t ch, uint8_t param_id)
{
    if (ch >= SENSOR_CHANNEL_COUNT) return 0u;
    const cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[ch];
    switch (param_id)
    {
        case PARAM_FINGER_TH:    return wc->fingerTh;
        case PARAM_NOISE_TH:     return wc->noiseTh;
        case PARAM_NEG_NOISE_TH: return wc->nNoiseTh;
        case PARAM_HYSTERESIS:   return wc->hysteresis;
        case PARAM_ON_DEBOUNCE:  return wc->onDebounce;
        case PARAM_LOW_BSLN_RST: return wc->lowBslnRst;
        case PARAM_RESOLUTION:    return wc->resolution;
        case PARAM_SNS_CLK_DIV:   return wc->snsClk;
        case PARAM_IDAC_MOD:      return wc->idacMod[0];
        case PARAM_SNS_CLK_SOURCE:return wc->snsClkSource;
        case PARAM_IDAC_GAIN:     return wc->idacGainIndex;
        default: return 0u;
    }
}

static inline void _recalibrate_dirty_channels(void)
{
#if (defined(CY_CAPSENSE_CSD_CALIBRATION_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
    uint32_t w;

    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        if ((idac_dirty_mask & ((uint64_t)1u << w)) != 0u)
        {
            (void)_calibrate_widget_locked(w);   /* 锁定通道按其自身增益档校准 */
        }
    }
    /* 校准把增益档拉回全局起点档, 此处把用户锁定值写回; 调用方随后的 Initialize 使其下到硬件。 */
    (void)_idac_lock_restore();
#endif
    idac_dirty_mask = 0u;
}

// 装载指令响应帧（直接填 TX FIFO；ISR 上下文，与 spi_load_touch 同）。
static void spi_load_cmd_response(uint8_t command, uint8_t b2, uint8_t b3, uint32_t val24)
{
    spi_tx_frame[0] = SENSOR_FRAME_MAGIC;
    spi_tx_frame[1] = command;
    spi_tx_frame[2] = b2;
    spi_tx_frame[3] = b3;
    spi_tx_frame[4] = (uint8_t)(val24 & 0xFFu);
    spi_tx_frame[5] = (uint8_t)((val24 >> 8u) & 0xFFu);
    spi_tx_frame[6] = (uint8_t)((val24 >> 16u) & 0xFFu);
    Cy_SCB_SPI_WriteArray(scb_0_HW, spi_tx_frame, SENSOR_FRAME_SIZE);
}

static uint16_t cmd_get_raw(uint8_t ch)
{
    if (ch >= SENSOR_CHANNEL_COUNT) return 0u;
    return cy_capsense_context.ptrWdConfig[ch].ptrSnsContext[0].raw;
}

