NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
// GET_STATS 响应: [magic, GET_STATS, 0, scan_count u32 LE(字节3..6)]
static void spi_load_stats(void)
{
    uint32_t sc = scan_count;   // CM0+ 上 32 位对齐读原子
    spi_tx_frame[0] = SENSOR_FRAME_MAGIC;
    spi_tx_frame[1] = SENSOR_CMD_GET_STATS;
    spi_tx_frame[2] = g_op_busy;   // 处理中标志(1=主循环正在做重操作), 供 RP2040 轮询至真实完成
    spi_tx_frame[3] = (uint8_t)(sc & 0xFFu);
    spi_tx_frame[4] = (uint8_t)((sc >> 8u) & 0xFFu);
    spi_tx_frame[5] = (uint8_t)((sc >> 16u) & 0xFFu);
    spi_tx_frame[6] = (uint8_t)((sc >> 24u) & 0xFFu);
    Cy_SCB_SPI_WriteArray(scb_0_HW, spi_tx_frame, SENSOR_FRAME_SIZE);
}

static void spi_load_frame(uint8_t command, uint8_t sequence, const uint8_t payload[SENSOR_FRAME_PAYLOAD_SIZE])
{
    uint32_t index;

    spi_tx_frame[0] = SENSOR_FRAME_MAGIC;
    spi_tx_frame[1] = command;
    spi_tx_frame[2] = sequence;
    for (index = 0u; index < SENSOR_FRAME_PAYLOAD_SIZE; index++)
    {
        spi_tx_frame[3u + index] = (payload != NULL) ? payload[index] : 0u;
    }
    Cy_SCB_SPI_WriteArray(scb_0_HW, spi_tx_frame, SENSOR_FRAME_SIZE);
}

static void spi_load_pong(uint8_t sequence)
{
    uint8_t payload[SENSOR_FRAME_PAYLOAD_SIZE];
    payload[0] = (uint8_t)(FW_VERSION & 0xFFu);
    payload[1] = (uint8_t)((FW_VERSION >> 8u) & 0xFFu);
    payload[2] = (uint8_t)((FW_VERSION >> 16u) & 0xFFu);
    payload[3] = (uint8_t)((FW_VERSION >> 24u) & 0xFFu);
    spi_load_frame(SENSOR_CMD_PONG, sequence, payload);
}

static void spi_latch_snapshot(uint8_t sequence)
{
    uint8_t payload[SENSOR_FRAME_PAYLOAD_SIZE];
    uint8_t source_index = published_snapshot_index;

    transfer_valid = published_snapshot_valid;
    transfer_generation = snapshot_generations[source_index];
    if (transfer_valid)
    {
        memcpy(transfer_snapshot, snapshot_buffers[source_index], SENSOR_SNAPSHOT_SIZE);
    }
    else
    {
        memset(transfer_snapshot, 0, SENSOR_SNAPSHOT_SIZE);
    }

    payload[0] = (uint8_t)(transfer_generation & 0xFFu);
    payload[1] = (uint8_t)((transfer_generation >> 8u) & 0xFFu);
    payload[2] = transfer_valid ? 1u : 0u;
    payload[3] = SENSOR_CHANNEL_COUNT;
    spi_load_frame(SENSOR_CMD_SNAPSHOT_INFO, sequence, payload);
}

static void spi_load_snapshot_page(uint8_t sequence, uint8_t page)
{
    uint8_t payload[SENSOR_FRAME_PAYLOAD_SIZE] = {0u};

    if (page < SENSOR_SNAPSHOT_PAGE_COUNT)
    {
        uint32_t offset = (uint32_t)page * SENSOR_SNAPSHOT_PAGE_SIZE;
        memcpy(payload, &transfer_snapshot[offset], SENSOR_SNAPSHOT_PAGE_SIZE);
        spi_load_frame(SENSOR_CMD_SNAPSHOT_DATA, sequence, payload);
    }
    else
    {
        spi_load_pong(sequence);
    }
}

/* ---- JIT 算法引擎 SPI 命令处理（ISR 上下文，仅做快速缓冲写入/标志置位）---- */
static void spi_load_algo_response(uint8_t command, uint8_t b2, uint8_t b3, uint16_t len)
{
    spi_tx_frame[0] = SENSOR_FRAME_MAGIC;
    spi_tx_frame[1] = command;
    spi_tx_frame[2] = b2;
    spi_tx_frame[3] = b3;
    spi_tx_frame[4] = (uint8_t)(len & 0xFFu);
    spi_tx_frame[5] = (uint8_t)((len >> 8u) & 0xFFu);
    spi_tx_frame[6] = 0u;
    Cy_SCB_SPI_WriteArray(scb_0_HW, spi_tx_frame, SENSOR_FRAME_SIZE);
}

static void cmd_algo_begin(uint8_t len_lo, uint8_t len_hi)
{
    uint16_t len = (uint16_t)len_lo | ((uint16_t)len_hi << 8u);
    if (len > ALGO_SLOT_SIZE) { len = ALGO_SLOT_SIZE; }
    algo_expected_len = len;
    algo_commit_pending = false;   /* 新一轮上传，废弃上一次未 commit 的请求 */
    spi_load_algo_response(ALGO_BEGIN, len_lo, len_hi, len);
}

static void cmd_algo_page(uint8_t page, uint8_t d0, uint8_t d1, uint8_t d2, uint8_t d3)
{
    uint32_t offset = (uint32_t)page * 4u;
    if ((offset + 4u) <= ALGO_SLOT_SIZE)
    {
        algo_staging[offset]      = d0;
        algo_staging[offset + 1u] = d1;
        algo_staging[offset + 2u] = d2;
        algo_staging[offset + 3u] = d3;
    }
    spi_load_algo_response(ALGO_PAGE, page, 0u, 0u);
}

static void cmd_algo_end(uint8_t crc_lo, uint8_t crc_hi)
{
    /* ISR 只置位 pending + 记录 CRC/len；真正的 CRC 校验与 memcpy 由主循环执行(见主循环)。
     * ok=1 表示"已接收，将校验"；实际校验结果由后续 ALGO_INFO 反映(§设计文档 4)。 */
    algo_commit_crc = (uint16_t)crc_lo | ((uint16_t)crc_hi << 8u);
    algo_commit_pending = true;
    spi_load_algo_response(ALGO_END, 1u, 0u, algo_expected_len);
}

static void cmd_algo_info(void)
{
    spi_load_algo_response(ALGO_INFO, algo_valid ? 1u : 0u, 0u, algo_len);
}

/* 设置每通道 16 位 ROM：帧 [magic,SET_ROM,ch,rom_lo,rom_hi,0,0]。回显 [.. ,ch,0,rom] 供校验。 */
static void cmd_algo_set_rom(uint8_t ch, uint8_t rom_lo, uint8_t rom_hi)
{
    uint16_t rom = (uint16_t)rom_lo | ((uint16_t)rom_hi << 8u);
    if (ch < SENSOR_CHANNEL_COUNT) { g_algo_rom[ch] = rom; }
    spi_load_algo_response(ALGO_SET_ROM, ch, 0u, rom);
}

/* 读每通道 16 位 ROM：帧 [magic,GET_ROM,ch,..]。响应 [.. ,ch,0,rom_lo,rom_hi,0]。 */
static void cmd_algo_get_rom(uint8_t ch)
{
    uint16_t rom = (ch < SENSOR_CHANNEL_COUNT) ? g_algo_rom[ch] : 0u;
    spi_load_algo_response(ALGO_GET_ROM, ch, 0u, rom);
}

/* 读某通道算法追踪: 帧 [magic,GET_TRACE,ch,idx,..]。响应 [.. ,ch,out_active,report[idx]_lo,report[idx]_hi,0]。
 * 供上位机在单通道调整页可视化算法上报变量(report[])与触发判定(out_active)。 */
static void cmd_algo_get_trace(uint8_t ch, uint8_t idx)
{
    uint16_t rep = 0u;
    uint8_t  act = 0u;
    if ((ch < SENSOR_CHANNEL_COUNT) && (idx < 4u))
    {
        rep = g_algo_io[ch].report[idx];
        act = (g_algo_io[ch].out_active != 0u) ? 1u : 0u;
    }
    spi_load_algo_response(ALGO_GET_TRACE, ch, act, rep);
}

/* 设共享算法可设置变量: 帧 [magic,SET_CFG,idx,val,..]。cfg[idx]=val, 下次算法执行拷入 io->cfg。 */
static void cmd_algo_set_cfg(uint8_t idx, uint8_t val)
{
    if (idx < 8u) { g_algo_cfg[idx] = val; }
    spi_load_algo_response(ALGO_SET_CFG, idx, 0u, (idx < 8u) ? g_algo_cfg[idx] : 0u);
}

/* 读共享算法可设置变量: 帧 [magic,GET_CFG,idx,..]。响应 [.. ,idx,0,cfg[idx],0,0]。 */
static void cmd_algo_get_cfg(uint8_t idx)
{
    uint16_t val = (idx < 8u) ? (uint16_t)g_algo_cfg[idx] : 0u;
    spi_load_algo_response(ALGO_GET_CFG, idx, 0u, val);
}

static void spi_slave_init(void)
{
    static const cy_stc_sysint_t spi_int_cfg =
    {
        .intrSrc = scb_0_IRQ,
        .intrPriority = 2u,   /* 高于 capsense(3)，保证 SPI 及时响应，不被扫描阻塞 */
    };

    Cy_SCB_SPI_Init(scb_0_HW, &scb_0_config, &spi_context);
    Cy_SCB_SPI_Enable(scb_0_HW);
    Cy_SCB_SPI_ClearRxFifo(scb_0_HW);
    Cy_SCB_SPI_ClearTxFifo(scb_0_HW);
    update_touch_frame();
    spi_load_touch();   /* 默认响应=实时触控帧（流水线快路） */

