NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
    /* 中断驱动：RX FIFO 达到整帧(7字节)即中断，ISR 立即装载响应。
       RX LEVEL 中断在 FIFO 计数 > level 时触发，故 level=帧长-1=6 → 满 7 字节触发。 */
    Cy_SysInt_Init(&spi_int_cfg, spi_isr);
    NVIC_ClearPendingIRQ(scb_0_IRQ);
    NVIC_EnableIRQ(scb_0_IRQ);
    Cy_SCB_SetRxFifoLevel(scb_0_HW, SENSOR_FRAME_SIZE - 1u);
    Cy_SCB_SetRxInterruptMask(scb_0_HW, CY_SCB_RX_INTR_LEVEL);
}

static void spi_isr(void)
{
    if (Cy_SCB_SPI_GetNumInRxFifo(scb_0_HW) >= SENSOR_FRAME_SIZE)
    {
        spi_slave_task();
    }
    Cy_SCB_ClearRxInterrupt(scb_0_HW, CY_SCB_RX_INTR_LEVEL);
}

static void spi_slave_task(void)
{
    uint8_t rx[SENSOR_FRAME_SIZE];

    if (Cy_SCB_SPI_GetNumInRxFifo(scb_0_HW) < SENSOR_FRAME_SIZE)
    {
        return;
    }

    Cy_SCB_SPI_ReadArray(scb_0_HW, rx, SENSOR_FRAME_SIZE);
    Cy_SCB_SPI_ClearTxFifo(scb_0_HW);

    if (rx[0] != SENSOR_FRAME_MAGIC)
    {
        spi_load_touch();   /* 默认回落触控帧 */
        return;
    }

    // 白灯仅启动时点亮、之后熄灭(见 main())；此处不再随帧翻转链路态。
    switch (rx[1])
    {
        case SENSOR_CMD_PING:
            spi_load_pong(rx[2]);
            break;

        case SENSOR_CMD_SNAPSHOT_BEGIN:
            spi_latch_snapshot(rx[2]);
            break;

        case SENSOR_CMD_SNAPSHOT_PAGE:
            spi_load_snapshot_page(rx[2], rx[3]);
            break;

        case SENSOR_CMD_INDICATOR_ON:
            Cy_GPIO_Write(STATUS_LED_PORT, STATUS_LED_NUM, STATUS_LED_ON_STATE);
            spi_load_pong(rx[2]);
            break;

        case SENSOR_CMD_SET_PARAM: {
            uint32_t val = (uint32_t)rx[4] | ((uint32_t)rx[5] << 8u) | ((uint32_t)rx[6] << 16u);
            (void)cmd_set_param(rx[2], rx[3], val);
            // 回显【实际当前值】(非法被拒时=旧值), 供上位机据实回读, 天然拦截非法调参。
            spi_load_cmd_response(SENSOR_CMD_SET_PARAM, rx[2], rx[3], cmd_get_param(rx[2], rx[3]));
            break;
        }

        case SENSOR_CMD_GET_PARAM:
            spi_load_cmd_response(SENSOR_CMD_GET_PARAM, rx[2], rx[3], cmd_get_param(rx[2], rx[3]));
            break;

        case SENSOR_CMD_GET_RAW:
            spi_load_cmd_response(SENSOR_CMD_GET_RAW, rx[2], 0u, cmd_get_raw(rx[2]));
            break;

        case SENSOR_CMD_GET_STATS:
            spi_load_stats();
            break;

        case SENSOR_CMD_SET_GLOBAL: {
            uint32_t val = (uint32_t)rx[4] | ((uint32_t)rx[5] << 8u) | ((uint32_t)rx[6] << 16u);
            cmd_set_global(rx[2], val);
            spi_load_cmd_response(SENSOR_CMD_SET_GLOBAL, rx[2], 0u, val);
            break;
        }

        case SENSOR_CMD_GET_GLOBAL:
            spi_load_cmd_response(SENSOR_CMD_GET_GLOBAL, rx[2], 0u, cmd_get_global(rx[2]));
            break;

        case SENSOR_CMD_GLOBAL_COMMIT:
            // 全部全局项已设入影子 → 主循环执行【一次】完整重初始化生效。
            global_apply_pending = true;
            g_op_busy = 1u;   // 处理中锁定: 主循环完成完整重初始化后清 0
            spi_load_cmd_response(SENSOR_CMD_GLOBAL_COMMIT, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_MEASURE_CP:
            // 耗时测量由主循环执行；ACK 仅表示命令已由 SPI ISR 实际接收并置为 pending。
            measure_cp_pending = true;
            spi_load_cmd_response(SENSOR_CMD_MEASURE_CP, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_GET_CP:
            // pending/active 时统一返回 0，防止 ISR 观察到主循环逐通道更新的半成品。
            spi_load_cmd_response(SENSOR_CMD_GET_CP, rx[2], 0u,
                                  (rx[2] >= SENSOR_CHANNEL_COUNT) ? 0xFFFFFFu :
                                  ((measure_cp_pending || measure_cp_active) ? 0u : cp_value[rx[2]]));
            break;

        case SENSOR_CMD_APPLY:
            // ★不能在 ISR 里做重校准(耗时数ms/需扫描完成)★：仅置标志，主循环执行。
            apply_pending = true;
            g_op_busy = 1u;   // 处理中锁定
            spi_load_cmd_response(SENSOR_CMD_APPLY, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_CALIBRATE:
            // 真正的 IDAC 重校准(CalibrateAllWidgets)+基线复位; 耗时, 仅置标志由主循环执行。
            calibrate_pending = true;
            g_op_busy = 1u;   // 处理中锁定
            spi_load_cmd_response(SENSOR_CMD_CALIBRATE, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_BASELINE_RESET:
            // 仅重置全部通道基线; 主循环执行 InitializeAllBaselines。
            baseline_reset_pending = true;
            g_op_busy = 1u;   // 处理中锁定
            spi_load_cmd_response(SENSOR_CMD_BASELINE_RESET, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_AUTO_TUNE:
            // 频率自适应下探(耗时: 粗定位+细搜+落档重校准); 仅置标志由主循环执行, 结果经 GET_AUTO_TUNE 读。
            // rx[2]=目标通道(0..35 单通道 / 0xFF 全通道); 非法值退化为全通道。
            // rx[3]=灵敏度偏好档位(1..7); 非法/缺省(0)退化为 4(居中)。
            auto_tune_ch      = (rx[2] < SENSOR_CHANNEL_COUNT) ? rx[2] : AUTO_TUNE_CH_ALL;
            auto_tune_pref    = ((rx[3] >= 1u) && (rx[3] <= 7u)) ? rx[3] : 4u;
            auto_tune_pending = true;
            auto_tune_result  = 0u;   // 进行中
            auto_tune_phase   = AUTO_TUNE_PHASE_IDLE;   // 已受理, 主循环下一轮开始推进阶段
            auto_tune_step    = 0u;
            auto_tune_div     = 0u;
            g_op_busy = 1u;           // 处理中锁定(host 轮询 busy 至真实完成)
            spi_load_cmd_response(SENSOR_CMD_AUTO_TUNE, auto_tune_ch, 0u, 0u);
            break;

        case SENSOR_CMD_GET_AUTO_TUNE:
            // 读结果/进度: [result, ch, div_lo, div_hi, progress]; progress = phase | (step << 3)。
            spi_load_cmd_response(SENSOR_CMD_GET_AUTO_TUNE, auto_tune_result, auto_tune_ch,
                                  (uint32_t)auto_tune_div |
                                  (((uint32_t)(auto_tune_phase & 0x07u) |
                                    ((uint32_t)(auto_tune_step & 0x1Fu) << 3u)) << 16u));
            break;

        case SENSOR_CMD_SET_MODE:
            // rx[2]: 0=自动校准/标准完整处理，非0=半自动手动。主循环据此选处理链。
            scan_mode = (rx[2] != 0u) ? SCAN_MODE_SEMI : SCAN_MODE_AUTO;
            spi_load_cmd_response(SENSOR_CMD_SET_MODE, scan_mode, 0u, 0u);
            break;

        case ALGO_BEGIN:
            cmd_algo_begin(rx[2], rx[3]);
            break;

        case ALGO_PAGE:
            cmd_algo_page(rx[2], rx[3], rx[4], rx[5], rx[6]);
            break;

