NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
        case ALGO_END:
            cmd_algo_end(rx[2], rx[3]);
            break;

        case ALGO_INFO:
            cmd_algo_info();
            break;

        case ALGO_SET_ROM:
            cmd_algo_set_rom(rx[2], rx[3], rx[4]);
            break;

        case ALGO_GET_ROM:
            cmd_algo_get_rom(rx[2]);
            break;

        case ALGO_GET_TRACE:
            cmd_algo_get_trace(rx[2], rx[3]);
            break;

        case ALGO_SET_CFG:
            cmd_algo_set_cfg(rx[2], rx[3]);
            break;

        case ALGO_GET_CFG:
            cmd_algo_get_cfg(rx[2]);
            break;

        case SENSOR_CMD_TOUCH:
        default:
            /* 触控快路（流水线）：装入最新触控帧，供下一次读取立即返回。 */
            spi_load_touch();
            break;
    }
}

/* 自适应原子动作：把 snsClk 分频写进目标 widget 并就地校准一次, 返回该分频下 IDAC 能否把 raw
 * 校到目标容差内。粗定位/细搜/落档/回退四处复用, 避免复制粘贴。
 * ★恒为单通道判定★: 全通道模式也由外层逐通道调用本函数(不再有"写全部 widget 同一分频"的路径)。
 * ★IDAC 档口径★: 经 _calibrate_widget_locked 校准, 故"该分频能否压到目标%"是在该通道自己的
 * 增益档(用户设过 PARAM_IDAC_GAIN 时)下判定的, 而不是全局起点档。 */
static inline bool auto_tune_try_div(uint8_t target_ch, uint16_t div)
{
    if (target_ch >= SENSOR_CHANNEL_COUNT) return false;
    cy_capsense_tuner.widgetContext[target_ch].snsClk = div;
    return _calibrate_widget_locked((uint32_t)target_ch);
}

/* 自适应"打点 + 试探"：先把阶段/步序/当前试探分频发布(SPI ISR 经 GET_AUTO_TUNE 上报, 长过程可见),
 * 再执行一次试探校准。粗定位/细搜/落档/回退四处共用, 避免每处复制打点代码。 */
static inline bool auto_tune_probe(uint8_t target_ch, uint16_t div, uint8_t phase, uint32_t step)
{
    auto_tune_phase = phase;
    auto_tune_step  = (step > AUTO_TUNE_STEP_MAX_REPORT) ? (uint8_t)AUTO_TUNE_STEP_MAX_REPORT : (uint8_t)step;
    auto_tune_div   = div;   /* 进行中语义: div 字段 = 当前试探值(完成时被最终分频覆盖) */
    return auto_tune_try_div(target_ch, div);
}

/* 单通道完整三步自适应: ①粗表定位 ②1 步进上探临界 ③按 pref 落档(失败逐 1 回退)。
 * 成功时 *out_div = 最终写入该 widget 的分频。全通道模式由外层逐通道复用本函数, 使每个通道各自
 * 落在其自身临界频率上(面板 Cp 22~138pF, 单一统一分频必然被最高 Cp 的通道拖垮)。 */
static bool auto_tune_run_ch(uint8_t target_ch, uint8_t pref, uint16_t* out_div)
{
    static const uint16_t k_autotune_divs[] = { 8u, 12u, 16u, 20u, 24u, 32u, 40u, 48u, 64u };
    const uint32_t div_count = sizeof(k_autotune_divs) / sizeof(k_autotune_divs[0]);
    uint16_t saved_div = cy_capsense_tuner.widgetContext[target_ch].snsClk;
    uint16_t div_edge = 0u;   /* 临界分频(最高频率, 校准刚好通过) */
    uint16_t div_target;
    uint32_t di;
    uint32_t step;

    /* ① 粗定位: 粗表升序(升分频=降频)扫描, 首个校准成功的档位必然 >= 真实临界值。 */
    for (di = 0u; di < div_count; di++)
    {
        if (auto_tune_probe(target_ch, k_autotune_divs[di], AUTO_TUNE_PHASE_COARSE, di + 1u))
        {
            div_edge = k_autotune_divs[di];
            break;
        }
    }
    if (div_edge == 0u)
    {
        /* 粗定位全失败时必须恢复原分频并尝试校准，否则最后试探值会残留为坏状态。 */
        cy_capsense_tuner.widgetContext[target_ch].snsClk = saved_div;
        (void)_calibrate_widget_locked(target_ch);
        return false;
    }

    /* ② 1 步进上探临界: 从 div_edge-1 起逐 1 降分频(升频)重校准, 成功即继续;
     *    首次失败即停, 最后一个成功值就是临界分频。 */
    for (step = 0u; step < AUTO_TUNE_FINE_STEPS_MAX; step++)
    {
        if (div_edge <= 1u) break;
        if (!auto_tune_probe(target_ch, (uint16_t)(div_edge - 1u),
                             AUTO_TUNE_PHASE_FINE, step + 1u)) break;
        div_edge = (uint16_t)(div_edge - 1u);
    }

    /* ③ 按偏好落档: 每档往低频让 2 个分频(充电更充分→过充近场效应→更灵敏)。 */
    div_target = (uint16_t)(div_edge + 2u * (uint16_t)(pref - 1u));
    if (div_target > 255u) div_target = 255u;   /* PSoC snsClk 合法范围 1..255 */
    step = 1u;
    while (!auto_tune_probe(target_ch, div_target, AUTO_TUNE_PHASE_SETTLE, step))
    {
        step++;
        /* 落档失败(该低频下 IDAC 反而压不住): 朝临界方向逐 1 回退重试;
         * 退到临界仍失败则在临界档重校准一次(已知可用)并采用它。 */
        if (div_target <= div_edge)
        {
            (void)auto_tune_probe(target_ch, div_edge, AUTO_TUNE_PHASE_SETTLE, step);
            div_target = div_edge;
            break;
        }
        div_target = (uint16_t)(div_target - 1u);
    }
    if (out_div != NULL) *out_div = div_target;
    return true;
}

int main(void)
{
    cy_rslt_t result = cybsp_init();
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }

    memset(snapshot_buffers, 0, sizeof(snapshot_buffers));
    memset(snapshot_generations, 0, sizeof(snapshot_generations));
    memset(transfer_snapshot, 0, sizeof(transfer_snapshot));
    for (uint32_t channel = 0u; channel < SENSOR_CHANNEL_COUNT; channel++)
    {
        cp_value[channel] = 0xFFFFFFu;
    }
    measure_cp_pending = false;
    measure_cp_active = false;
    global_apply_pending = false;
    calibrate_pending = false;
    baseline_reset_pending = false;
    auto_tune_pending = false;
    auto_tune_result = 0u;
    auto_tune_div = 0u;
    auto_tune_ch = AUTO_TUNE_CH_ALL;
    auto_tune_phase = AUTO_TUNE_PHASE_IDLE;
    auto_tune_step = 0u;
    g_any_active = false;
    published_snapshot_index = 0u;
    published_snapshot_valid = false;
    transfer_generation = 0u;
    transfer_valid = false;
    memset(g_algo_io, 0, sizeof(g_algo_io));
    memset(algo_prev_active, 0, sizeof(algo_prev_active));
    for (uint32_t channel = 0u; channel < SENSOR_CHANNEL_COUNT; channel++) { g_algo_rom[channel] = 0u; }
    for (uint32_t k = 0u; k < 8u; k++) { g_algo_cfg[k] = 0u; }
    algo_valid = false;
    algo_len = 0u;
    algo_expected_len = 0u;
    algo_commit_pending = false;

    __enable_irq();
    initialize_ms_tick();
    initialize_common_cfg_shadow();   /* 必须在 initialize_capsense 前: 重定向 ptrCommonConfig 到 RAM 影子 */
    initialize_capsense();
    spi_slave_init();
    // hardware.txt: P1.6 -> LED -> R -> GND，因此高电平明确为点亮。
    // 白灯启动即点亮作为 bring-up 指示；800ms 后仅由已加载 JIT 算法的判定结果驱动，
    // 原始 CapSense 触控不会触发白灯，避免把非 JIT 模式误呈现为算法已触发。
    Cy_GPIO_Write(STATUS_LED_PORT, STATUS_LED_NUM, STATUS_LED_ON_STATE);
    /* ★可见启动指示(修"重启白灯不亮")★: 白灯在启动后保持点亮 800ms 再交给 g_any_active 驱动,
     * 使每次上电/XRES 重启都有肉眼可见的白灯闪亮(否则仅亮几微秒无法察觉, 用户误判"重启无效")。 */
    uint32_t led_boot_until_ms = g_ms_tick + 800u;
    Cy_CapSense_ScanAllWidgets(&cy_capsense_context);

    for (;;)
    {
        /* SPI 从机改为中断驱动（spi_isr），主循环只做 capsense 扫描/发布快照。
           SPI 响应不再被 ProcessAllWidgets 的耗时阻塞。 */
        if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(&cy_capsense_context))
        {
            if (scan_mode == SCAN_MODE_AUTO)
            {
                /* 自动校准：运行中间件标准完整处理链。 */
                (void)Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);
            }
            else
            {
                /* 半自动手动：跳过 CALC_NOISE+THRESHOLDS，手动 SET_PARAM 阈值不被覆盖，
                 * 仍跑滤波/基线/差值/状态，触控检测正常（用手动 fingerTh 判定）。 */
                const uint32_t manual_mask = CY_CAPSENSE_PROCESS_FILTER |
                                             CY_CAPSENSE_PROCESS_BASELINE |
                                             CY_CAPSENSE_PROCESS_DIFFCOUNTS |
                                             CY_CAPSENSE_PROCESS_STATUS;
                for (uint32_t w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
                {
                    (void)Cy_CapSense_ProcessWidgetExt(w, manual_mask, &cy_capsense_context);
                }
            }
            update_touch_frame();       /* 刷新实时触控帧（快路数据源） */
            /* 白 LED: 启动 800ms 内常亮(可见启动指示)；之后只有算法显式写 out_led 才亮。 */
            Cy_GPIO_Write(STATUS_LED_PORT, STATUS_LED_NUM,
                          (g_any_active || (g_ms_tick < led_boot_until_ms))
                              ? STATUS_LED_ON_STATE : STATUS_LED_OFF_STATE);
            publish_capsense_snapshot();/* 刷新完整 raw/baseline/diff（调参慢路数据源） */

            /* MEASURE_CP：逐电极 BIST 寄生电容测量(fF)。测量会重配 CSD HW，完成后恢复扫描配置。 */
            {
                bool run_measure = false;
                uint32_t interrupt_state = Cy_SysLib_EnterCriticalSection();
                if (measure_cp_pending)
                {
                    measure_cp_pending = false;
                    measure_cp_active = true;
                    run_measure = true;
                }
                Cy_SysLib_ExitCriticalSection(interrupt_state);

                if (run_measure)
                {
                    /* 先统一标为失败；BIST 可用的 Cp 结果随后覆盖。active 期间 SPI GET_CP 始终返回 0。 */
                    for (uint32_t w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
                    {
                        cp_value[w] = 0xFFFFFFu;
                    }
#if (defined(CY_CAPSENSE_TST_SNS_CAP_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN))
                    for (uint32_t w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
                    {
                        uint32_t v = 0u;
                        cy_en_capsense_bist_status_t status =
                            Cy_CapSense_MeasureCapacitanceSensor(w, 0u, &v, &cy_capsense_context);

                        /* HIGH_LIMIT is the 400pF BIST saturation/overrange outcome and
                         * indicates a short-circuit fault; LOW_LIMIT indicates abnormally
                         * small capacitance. Both are faults, like BAD_PARAM/HW_BUSY/TIMEOUT/ERROR
                         * and a zero result, so the prefilled 0xFFFFFF failure marker remains.
                         * Only a nonzero SUCCESS result is valid. 0xFFFFFF remains reserved for
                         * the protocol failure marker, so a colliding valid value saturates at
                         * 0xFFFFFE. */
                        if ((CY_CAPSENSE_BIST_SUCCESS_E == status) && (v != 0u))
                        {
                            cp_value[w] = (v >= 0xFFFFFFu) ? 0xFFFFFEu : v;
                        }
                    }
                    /* 测量是只读动作，不得触发全局重校准；仅从现有 widgetContext 恢复硬件和基线。 */
                    (void)Cy_CapSense_Initialize(&cy_capsense_context);
                    Cy_CapSense_InitializeAllBaselines(&cy_capsense_context);
#endif
                    interrupt_state = Cy_SysLib_EnterCriticalSection();
                    measure_cp_active = false;
                    Cy_SysLib_ExitCriticalSection(interrupt_state);
                }
            }

            /* ALGO_END commit：主循环校验 CRC16 + 拷贝 1KB，避免在 ISR 里做耗时 memcpy。
             * 校验失败拒绝、保留旧算法(algo_valid 不变)，符合设计文档 §3 ALGO_END 语义。 */
            if (algo_commit_pending)
            {
                uint16_t len;
                uint16_t crc_expect;
                uint16_t crc_calc;

